Import relevant libraries

In [2]:
import numpy as np
import pandas as pd

Load datasets

In [3]:
marketing_sample1 = pd.read_csv("marketing_campaign_merge1.csv")
marketing_sample2 = pd.read_csv("marketing_campaign_merge2.csv")

Inspect the datasets

In [4]:
marketing_sample1.shape

(2240, 3)

In [5]:
marketing_sample1.head()

     ID  Year_Birth   Education
0  5524        1957  Graduation
1  2174        1954  Graduation
2  4141        1965  Graduation
3  6182        1984  Graduation
4  5324        1981         PhD

In [6]:
marketing_sample2.shape

(2240, 3)

In [7]:
marketing_sample2.head()

     ID Marital_Status   Income
0  5524         Single  58138.0
1  2174         Single  46344.0
2  4141       Together  71613.0
3  6182       Together  26646.0
4  5324        Married  58293.0

Merge the two datasets into one new dataset based on the common column (i.e. ID)

In [8]:
merged_data = pd.merge(marketing_sample1,marketing_sample2,on = "ID")
# merge the data according to ID

In [9]:
merged_data.shape

(2240, 5)

In [11]:
merged_data.head()

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [ ]:
# axis = 0 it will combine row wise 
concatenated_data = pd.concat([marketing_sample1, marketing_sample2], axis = 0)
concatenated_data.head()

,ID,Year_Birth,Education,Marital_Status,Income,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,5524.0,1957.0,Graduation,Single,58138.0,NaN,NaN,NaN,NaN,NaN
1,2174.0,1954.0,Graduation,Single,46344.0,NaN,NaN,NaN,NaN,NaN
2,4141.0,1965.0,Graduation,Together,71613.0,NaN,NaN,NaN,NaN,NaN
3,6182.0,1984.0,Graduation,Together,26646.0,NaN,NaN,NaN,NaN,NaN
4,5324.0,1981.0,PhD,Married,58293.0,NaN,NaN,NaN,NaN,NaN